{
  "backend/main.mo": "Empty Motoko actor serving as the backend entry point with no implemented functionality yet.",
  "feature_evidence.json": "Empty feature evidence report with no features documented.",
  "frontend-file-summaries.txt": "JSON object containing summaries of all frontend source files including components, pages, hooks, and configuration.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining design tokens for light and dark themes with neutral grayscale colors.",
  "frontend/index.html": "HTML entry point for the JobBiz Portal application with root div and module script reference.",
  "frontend/src/App.tsx": "Main application component configuring TanStack Router with routes for home, registration, jobs, business directory, profile, and wrapping with ThemeProvider and Toaster.",
  "frontend/src/components/Footer.tsx": "Footer component displaying copyright year and attribution link to caffeine.ai with UTM tracking parameters.",
  "frontend/src/components/Header.tsx": "Responsive header with navigation links, Internet Identity login/logout, mobile sheet menu, and user dropdown menu for authenticated users.",
  "frontend/src/components/Layout.tsx": "Layout wrapper component rendering Header, main content area with Outlet for route content, and Footer.",
  "frontend/src/hooks/useActor.ts": "React Query hook managing backend actor creation with Internet Identity authentication, automatically invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle.",
  "frontend/src/hooks/useQueries.ts": "Placeholder React Query hooks for user profile, jobs, and businesses data fetching, awaiting backend implementation.",
  "frontend/src/index.css": "Tailwind CSS configuration with OKLCH color system defining blue/purple primary colors and teal accents for light and dark modes.",
  "frontend/src/main.tsx": "Application entry point rendering the App component wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AddBusinessPage.tsx": "Page for adding a business listing to the directory, requiring Internet Identity authentication and collecting business details (name, category, description, contact info, location) via a form.",
  "frontend/src/pages/BusinessDirectoryPage.tsx": "Displays a searchable directory of businesses with mock data, showing business cards with category, description, phone, and location, plus a button to add new businesses.",
  "frontend/src/pages/EmployeeRegistrationPage.tsx": "Employee registration form requiring Internet Identity login, collecting personal and professional information (name, contact, experience, skills, education) with a registration fee notice.",
  "frontend/src/pages/EmployerRegistrationPage.tsx": "Employer registration form requiring Internet Identity login, collecting company information (name, industry, size, website, description, contact details) with a registration fee notice.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero section and features overview, promoting the dual job portal and business directory platform with call-to-action buttons for authenticated and unauthenticated users.",
  "frontend/src/pages/JobsPage.tsx": "Job listings page component that displays mock job data in cards with search/filter functionality by title, company, or location.",
  "frontend/src/pages/ProfilePage.tsx": "User profile page that displays Internet Identity principal ID, account status, and provides navigation to employer/employee registration forms with logout functionality.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme using OKLCH color space, container settings, custom fonts (Inter, Poppins), animations, and plugin integrations.",
  "project_state.json": "Project metadata defining a combined job portal and business directory application with Internet Identity authentication, Stripe payments, and unique ID generation for users."
}