{
  "backend/main.mo": "Main Motoko actor defining Employee, Employer, Business, and UserProfile types with ApprovalStatus variants (pending/approved/rejected), implementing registration, CRUD operations, and admin approval/rejection functions with access control integration.",
  "feature_evidence.json": "Feature evidence report documenting five implemented features: admin dashboard with approval actions, filtered job listings, filtered business directory, approval status indicators on profile page, and admin navigation link.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing their purpose and functionality, including pages, components, hooks, and configuration files.",
  "frontend/index.css": "Global Tailwind CSS styles with custom OKLCH color system defining CSS variables for light and dark themes with blue/purple primary colors and teal accents.",
  "frontend/index.html": "HTML entry point for the React application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with all routes (home, registrations, directory, jobs, profile, admin), wrapped in ThemeProvider and Toaster for notifications.",
  "frontend/src/components/ApprovalStatusBadge.tsx": "Reusable badge component displaying approval status with icons and colors: pending (clock), approved (checkmark with date), or rejected (X with reason and date).",
  "frontend/src/components/Footer.tsx": "Footer component displaying copyright year and attribution link to caffeine.ai with UTM tracking parameters.",
  "frontend/src/components/Header.tsx": "Responsive header with logo, navigation links, Internet Identity login/logout, user dropdown menu, mobile sheet menu, and conditional admin dashboard link visible only to admin users.",
  "frontend/src/components/Layout.tsx": "Layout wrapper component rendering Header, main content area with Outlet for nested routes, and Footer in a flex column structure.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state and initializing access control with an admin token from URL parameters.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for the application, managing login/logout state, identity persistence, and delegation validation using @dfinity/auth-client.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend operations including user profiles, admin checks, and CRUD operations for employees, employers, and businesses with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for theming (light/dark modes), defining colors for UI components like buttons, cards, charts, and sidebar elements using OKLCH color space.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider for data fetching and InternetIdentityProvider for authentication context.",
  "frontend/src/pages/AddBusinessPage.tsx": "Page component for authenticated users to submit business listings with a form collecting business details (name, category, contact info, address) and photo upload functionality.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin-only dashboard page with tabs for managing pending employees, employers, and businesses, providing approve/reject functionality with reason dialogs and access control checks.",
  "frontend/src/pages/BusinessDirectoryPage.tsx": "Displays a searchable directory of approved businesses with filtering by name, category, and location. Includes a button to add new businesses and shows business cards with contact information.",
  "frontend/src/pages/EmployeeRegistrationPage.tsx": "Employee registration form requiring Internet Identity authentication. Collects personal and professional information including name, contact details, experience, skills, and education with a registration fee notice.",
  "frontend/src/pages/EmployerRegistrationPage.tsx": "Employer registration form requiring Internet Identity authentication. Collects company information including name, industry, size, website, and contact details with a registration fee notice.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero section and feature cards showcasing the platform's job portal and business directory capabilities. Displays different CTAs based on authentication status.",
  "frontend/src/pages/JobsPage.tsx": "Job listings page that displays positions from approved employers with search functionality. Shows mock job postings derived from employer data with details like location, salary, and job type.",
  "frontend/src/pages/ProfilePage.tsx": "Profile page component that displays authenticated user's Internet Identity principal, account information, and registration status for employee, employer, and business roles with approval status badges and logout functionality.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, extended theme settings for typography, animations, and UI component styling including sidebar and chart colors.",
  "project_state.json": "Project state tracking file documenting a job portal and business directory application with Internet Identity authentication, Stripe payments, admin approval workflow, and listing existing and pending features."
}